{
    "Place": "Chichen Itza",
    "history": "Chichen Itza is an ancient Mayan city located in the Yucatan Peninsula, Mexico, known for its impressive archaeological ruins. It was one of the largest cities of the Maya civilization and served as a major political and economic center. The city reached its peak during the Late Classic period (600-900 AD) and continued to be inhabited until the arrival of the Spanish conquistadors in the 16th century. Chichen Itza is known for its iconic pyramid, El Castillo, also known as the Temple of Kukulcan, which served as a temple to the Mayan feathered serpent god Kukulcan.",
    "Ecological Relevance": "Chichen Itza is located in a region with a rich biodiversity of flora and fauna, including tropical rainforests, cenotes (natural sinkholes), and diverse wildlife. The site's architectural layout and structures also reflect the Mayan civilization's deep connection to astronomy and the natural world.",
    "timeline": [
        {
            "Year": "600-900 AD",
            "Details": "Chichen Itza reaches its peak as a major political and economic center of the Maya civilization."
        },
        {
            "Year": "Late 10th century",
            "Details": "Chichen Itza is believed to have been invaded by the Toltecs, influencing the site's architecture and art."
        },
        {
            "Year": "Post-Classic period (c. 1000-1550 AD)",
            "Details": "Chichen Itza becomes a major regional capital in the Yucatan Peninsula."
        },
        {
            "Year": "1526",
            "Details": "Spanish conquistador Francisco de Montejo attempts to conquer Chichen Itza but is unsuccessful."
        },
        {
            "Year": "Late 16th century",
            "Details": "Chichen Itza is abandoned and falls into decline, possibly due to droughts or political unrest."
        },
        {
            "Year": "1894",
            "Details": "Stephens and Catherwood publish their groundbreaking work on Chichen Itza, sparking interest in the site among archaeologists and tourists."
        },
        {
            "Year": "1924",
            "Details": "Chichen Itza is designated a National Monument by the Mexican government."
        },
        {
            "Year": "2007",
            "Details": "Chichen Itza is designated as one of the New Seven Wonders of the World."
        },
        {
            "Year": "2016",
            "Details": "Chichen Itza's Kukulcan Pyramid is found to be built atop a natural cave system, enhancing its ecological and historical significance."
        },
        {
            "Year": "Present Day",
            "Details": "Chichen Itza continues to be a popular tourist destination and a UNESCO World Heritage Site, showcasing the rich history and cultural legacy of the Maya civilization."
        }
    ]
}