{
    "Place": "The Great Wall of China",
    "history": "The Great Wall of China is a series of fortifications made of stone, brick, tamped earth, wood, and other materials, generally built along an east-to-west line across the historical northern borders of China to protect the Chinese states and empires against the raids and invasions of the various nomadic groups of the Eurasian Steppe.",
    "Ecological Relevance": "The Great Wall of China has played a crucial role in conserving the biodiversity of the region by creating a barrier that separates different ecosystems and prevents the spread of invasive species.",
    "timeline": [
        {
            "Year": "7th century BC",
            "Details": "The initial walls were built by various Chinese states to defend their borders."
        },
        {
            "Year": "3rd century BC",
            "Details": "The separate walls were connected and fortified by the first Emperor of China, Qin Shi Huang, to create the first unified Great Wall."
        },
        {
            "Year": "5th century AD",
            "Details": "Significant rebuilding and extension of the Great Wall occurred during the Northern Wei, Northern Qi, Northern Zhou, Sui, and Northern Song dynasties."
        },
        {
            "Year": "Ming Dynasty (1368-1644)",
            "Details": "The most well-known sections of the Great Wall were built during the Ming Dynasty."
        },
        {
            "Year": "17th century",
            "Details": "The decline of the Ming Dynasty led to the neglect and partial dismantling of the Great Wall."
        },
        {
            "Year": "19th century",
            "Details": "The Great Wall saw limited use in border defense during the Qing Dynasty."
        },
        {
            "Year": "20th century",
            "Details": "The Great Wall became a UNESCO World Heritage Site in 1987 and is one of the most iconic symbols of China."
        },
        {
            "Year": "21st century",
            "Details": "The Great Wall of China attracts millions of tourists annually and remains a symbol of China's rich history and cultural heritage."
        }
    ]
}