{
    "Place": "Whitehouse",
    "history": "The Whitehouse is the official residence and workplace of the President of the United States. It is located in Washington, D.C. and has been the residence of every U.S. president since John Adams in 1800. Designed by James Hoban, the Whitehouse was built between 1792 and 1800. It has undergone several renovations and expansions over the years, with the most recent major renovation occurring in the 1950s during the Truman administration.",
    "Ecological Relevance": "The Whitehouse is a symbol of American political power and is often used as a backdrop for important events, meetings, and announcements. It is also surrounded by the White House Gardens, which include a variety of trees, shrubs, and flowers, providing a green space in the heart of the nation's capital.",
    "timeline": [
        {
            "Year": "1792-1800",
            "Details": "Construction of the Whitehouse by James Hoban."
        },
        {
            "Year": "1800",
            "Details": "John Adams becomes the first president to live in the Whitehouse."
        },
        {
            "Year": "1814",
            "Details": "During the War of 1812, the Whitehouse is burned by British troops."
        },
        {
            "Year": "1901",
            "Details": "Theodore Roosevelt renames the Whitehouse and officially designates it as the Executive Mansion."
        },
        {
            "Year": "1950s",
            "Details": "Major renovation of the Whitehouse during the Truman administration."
        },
        {
            "Year": "1969",
            "Details": "The Whitehouse is officially designated a National Historic Landmark."
        },
        {
            "Year": "2001",
            "Details": "Following the 9/11 attacks, security measures around the Whitehouse are significantly increased."
        },
        {
            "Year": "2009",
            "Details": "The Whitehouse is equipped with solar panels by the Obama administration as part of a commitment to renewable energy."
        },
        {
            "Year": "2021",
            "Details": "Joseph R. Biden Jr. becomes the 46th President of the United States to reside in the Whitehouse."
        }
    ]
}